Revit 2027 API
ElectricalSystem.RemoveFromCircuit Method
remove a set of exist components from the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveFromCircuit(
	ElementSet components
)
Public Sub RemoveFromCircuit (
	components As ElementSet
)
public:
void RemoveFromCircuit(
	ElementSet^ components
)
member RemoveFromCircuit :
        components : ElementSet -> unit
Parameters
components ElementSet
The components removed from the electrical system.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the components parameter Value is null.
InvalidOperationException |  Thrown when the components cannot be removed from the system.
Remarks
If successful, all the components will remove from the system. Otherwise null is removed. This method will only function with the Autodesk Revit MEP application.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace